Documents/ЛБ_ПрейскурантЦенПример.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ПрейскурантЦенПример</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ПрейскурантЦенНаМеталлы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводитьНулевыеЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СхемыКредитования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЛБ_ПрейскурантЦенПример/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого СтрК Из Объект.СхемыКредитования Цикл
		ДобавитьКолонкуЦен(СтрК.КлючСтроки, СтрК.СхемаКредитования);
	КонецЦикла;	

	Для каждого Стр Из Объект.Цены Цикл
		ОтборТаб = Новый Структура;
		ОтборТаб.Вставить("Проба", стр.Проба);
		ОтборТаб.Вставить("Категория", стр.Категория);
        СтрокиТаб = ТаблицаЦен.НайтиСтроки(ОтборТаб);
		Если СтрокиТаб.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаЦен.Добавить();
			НоваяСтрока.Проба = стр.Проба;
			НоваяСтрока.Категория = стр.Категория;
		Иначе
			НоваяСтрока = СтрокиТаб.Получить(0); 
		КонецЕсли;	
		Отбор = Новый Структура;
		Отбор.Вставить("СхемаКредитования", Стр.СхемаКредитования);
		СтрокиК = Объект.СхемыКредитования.НайтиСтроки(Отбор);
		Если НЕ СтрокиК.Количество() = 0 Тогда
			СтрК = СтрокиК.Получить(0);
			НоваяСтрока["Цена_" + Строка(СтрК.КлючСтроки)] = Стр.Цена;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Цены.Очистить();
	
	Для каждого Стр Из ТаблицаЦен Цикл
		Для каждого СтрК Из Объект.СхемыКредитования Цикл
			Если НЕ Стр["Цена_" + Строка(СтрК.КлючСтроки)] = 0 Тогда
			    НоваяСтрока = ТекущийОбъект.Цены.Добавить();
			    НоваяСтрока.КлючСтроки = СтрК.КлючСтроки;
				НоваяСтрока.СхемаКредитования = СтрК.СхемаКредитования;
			    НоваяСтрока.Категория = Стр.Категория;
			    НоваяСтрока.Проба = Стр.Проба;
			    НоваяСтрока.Цена = Стр["Цена_" + Строка(СтрК.КлючСтроки)];
			КонецЕсли;				
		КонецЦикла;	
	КонецЦикла	
КонецПроцедуры

&НаКлиенте
Процедура СхемыКредитованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтрока = Элементы.СхемыКредитования.ТекущиеДанные;
		ТекСтрока.КлючСтроки = ПолучитьНовыйКлючСтроки();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыйКлючСтроки()
	Объект.СхемыКредитования.Сортировать("КлючСтроки Убыв");
	Возврат Объект.СхемыКредитования.Получить(0).КлючСтроки + 1;
КонецФункции	                   

&НаСервере
Процедура ДобавитьКолонкуЦен(КлючСтроки, Категория)
	МассивДобавляемыхРеквизитов = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("Цена_" + СокрЛП(КлючСтроки), Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)), "ТаблицаЦен");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	 
	ПолеВвода = Элементы.Добавить(
		"Цена_" + СокрЛП(КлючСтроки),    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		Элементы.ТаблицаЦен);	      //Контейнер для поля ввода (Форма,Группа,Страница)
		
	ПолеВвода.Заголовок = "Цена " + СокрЛП(Категория);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "ТаблицаЦен."+"Цена_" + СокрЛП(КлючСтроки);

КонецПроцедуры	

&НаКлиенте
Процедура СхемаКредитованияПриИзменении(Элемент)
	ТекСтрока = Элементы.СхемыКредитования.ТекущиеДанные;
	ДобавитьКолонкуЦен(ТекСтрока.КлючСтроки, ТекСтрока.СхемаКредитования);
КонецПроцедуры


&НаКлиенте
Процедура СхемыКредитованияПередНачаломИзменения(Элемент, Отказ)
	ТекСтрока = Элементы.СхемыКредитования.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.СхемаКредитования) Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СхемыКредитованияПередУдалениемНаСервере(МассивУдаляемыхРеквизитов)
	         
    ИзменитьРеквизиты( ,МассивУдаляемыхРеквизитов); 
КонецПроцедуры

&НаКлиенте
Процедура СхемыКредитованияПередУдалением(Элемент, Отказ)
	ТекСтрока = Элементы.СхемыКредитования.ТекущиеДанные;
	МассивУдаляемыхРеквизитов = Новый Массив;
    МассивУдаляемыхРеквизитов.Добавить("ТаблицаЦен." + "Цена_" + Строка(ТекСтрока.КлючСтроки));

	СхемыКредитованияПередУдалениемНаСервере(МассивУдаляемыхРеквизитов);
КонецПроцедуры

&НаКлиенте
Процедура СхемыКредитованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры
